#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/naga-paritala/terraform-samples/runs/run-nh2oinQfU44xxway

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
2021/01/05 14:38:28 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
2021/01/05 14:38:28 [INFO] Terraform version: 0.14.0  
2021/01/05 14:38:28 [INFO] Go runtime version: go1.15.2
2021/01/05 14:38:28 [INFO] CLI args: []string{"/usr/local/bin/terraform", "plan", "-out", "/terraform/terraform.tfplan", "-detailed-exitcode", "-var-file=/terraform/terraform.tfvars", "-lock=false", "-parallelism=10"}
2021/01/05 14:38:28 Loading CLI configuration from /tmp/cli.tfrc
2021/01/05 14:38:28 [INFO] CLI command args: []string{"plan", "-out", "/terraform/terraform.tfplan", "-detailed-exitcode", "-var-file=/terraform/terraform.tfvars", "-lock=false", "-parallelism=10"}
2021/01/05 14:38:28 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
2021/01/05 14:38:29 [INFO] Failed to read plugin lock file .terraform/plugins/linux_amd64/lock.json: open .terraform/plugins/linux_amd64/lock.json: no such file or directory
2021/01/05 14:38:29 [INFO] backend/local: starting Plan operation
2021-01-05T14:38:30.184Z [INFO]  plugin: configuring client automatic mTLS
2021-01-05T14:38:30.268Z [INFO]  plugin.terraform-provider-aws_v3.22.0_x5: configuring server automatic mTLS: timestamp=2021-01-05T14:38:30.267Z
2021-01-05T14:38:30.563Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-01-05T14:38:30.566Z [INFO]  plugin: configuring client automatic mTLS
2021-01-05T14:38:30.616Z [INFO]  plugin.terraform-provider-null_v3.0.0_x5: configuring server automatic mTLS: timestamp=2021-01-05T14:38:30.614Z
2021-01-05T14:38:30.736Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-01-05T14:38:30.738Z [INFO]  plugin: configuring client automatic mTLS
2021-01-05T14:38:30.789Z [INFO]  plugin.terraform-provider-random_v3.0.0_x5: configuring server automatic mTLS: timestamp=2021-01-05T14:38:30.789Z
2021-01-05T14:38:30.927Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021/01/05 14:38:30 [INFO] terraform: building graph: GraphTypeValidate
2021-01-05T14:38:30.942Z [INFO]  plugin: configuring client automatic mTLS
2021-01-05T14:38:31.041Z [INFO]  plugin.terraform-provider-aws_v3.22.0_x5: configuring server automatic mTLS: timestamp=2021-01-05T14:38:31.041Z
2021-01-05T14:38:31.508Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021/01/05 14:38:31 [INFO] backend/local: plan calling Plan
2021/01/05 14:38:31 [INFO] terraform: building graph: GraphTypePlan
99
2021-01-05T14:38:31.527Z [INFO]  plugin: configuring client automatic mTLS
2021-01-05T14:38:31.627Z [INFO]  plugin.terraform-provider-aws_v3.22.0_x5: configuring server automatic mTLS: timestamp=2021-01-05T14:38:31.627Z
2021/01/05 14:38:32 [INFO] ReferenceTransformer: reference not found: "var.cidr_block"
2021/01/05 14:38:32 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_iam_role.eks_role, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .force_detach_policies: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .max_session_duration: planned value cty.NumberIntVal(3600) does not match config value cty.NullVal(cty.Number)
      - .path: planned value cty.StringVal("/") does not match config value cty.NullVal(cty.String)
2021/01/05 14:38:32 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_iam_role.eks_node_group_role, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .max_session_duration: planned value cty.NumberIntVal(3600) does not match config value cty.NullVal(cty.Number)
      - .path: planned value cty.StringVal("/") does not match config value cty.NullVal(cty.String)
      - .force_detach_policies: planned value cty.False does not match config value cty.NullVal(cty.Bool)
2021/01/05 14:38:32 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.vpc.aws_vpc.main_vpc, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .enable_dns_support: planned value cty.True does not match config value cty.NullVal(cty.Bool)
      - .assign_generated_ipv6_cidr_block: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .instance_tenancy: planned value cty.StringVal("default") does not match config value cty.NullVal(cty.String)
2021/01/05 14:38:32 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2021/01/05 14:38:32 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2021/01/05 14:38:32 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2021/01/05 14:38:32 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.vpc.aws_subnet.private_db, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .assign_ipv6_address_on_creation: planned value cty.False does not match config value cty.NullVal(cty.Bool)
2021/01/05 14:38:32 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2021/01/05 14:38:32 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2021/01/05 14:38:32 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.vpc.aws_subnet.private_be, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .assign_ipv6_address_on_creation: planned value cty.False does not match config value cty.NullVal(cty.Bool)
2021/01/05 14:38:32 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2021/01/05 14:38:32 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.vpc.aws_subnet.public_fe, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .assign_ipv6_address_on_creation: planned value cty.False does not match config value cty.NullVal(cty.Bool)
2021/01/05 14:38:32 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2021/01/05 14:38:32 [INFO] ReferenceTransformer: reference not found: "aws_iam_role_policy_attachment.eks_role-AmazonEKSClusterPolicy"
2021/01/05 14:38:32 [INFO] ReferenceTransformer: reference not found: "aws_iam_role_policy_attachment.eks_role-AmazonEKSVPCResourceController"
2021/01/05 14:38:32 [INFO] ReferenceTransformer: reference not found: "var.subnet_fe_id"
2021/01/05 14:38:32 [INFO] ReferenceTransformer: reference not found: "var.subnet_be_id"
2021/01/05 14:38:32 [INFO] ReferenceTransformer: reference not found: "var.subnet_db_id"
2021/01/05 14:38:32 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_eks_cluster.eks_cluster, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .kubernetes_network_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .vpc_config[0].endpoint_private_access: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .vpc_config[0].endpoint_public_access: planned value cty.True does not match config value cty.NullVal(cty.Bool)
      - .vpc_config[0].subnet_ids: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String), cty.UnknownVal(cty.String), cty.UnknownVal(cty.String)})
2021/01/05 14:38:32 [INFO] ReferenceTransformer: reference not found: "aws_iam_role_policy_attachment.eks-node-group-role-AmazonEKSWorkerNodePolicy"
2021/01/05 14:38:32 [INFO] ReferenceTransformer: reference not found: "aws_iam_role_policy_attachment.eks-node-group-role-AmazonEKS_CNI_Policy"
2021/01/05 14:38:32 [INFO] ReferenceTransformer: reference not found: "aws_iam_role_policy_attachment.eks-node-group-role-AmazonEC2ContainerRegistryReadOnly"
2021/01/05 14:38:32 [INFO] ReferenceTransformer: reference not found: "var.subnet_fe_id"
2021/01/05 14:38:32 [INFO] ReferenceTransformer: reference not found: "var.subnet_be_id"
2021/01/05 14:38:32 [INFO] ReferenceTransformer: reference not found: "var.subnet_db_id"
2021/01/05 14:38:32 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_eks_node_group.eks_node_group, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .subnet_ids: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String), cty.UnknownVal(cty.String), cty.UnknownVal(cty.String)})
2021-01-05T14:38:32.347Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eks.aws_eks_cluster.eks_cluster will be created
  + resource "aws_eks_cluster" "eks_cluster" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "eks_cluster"
2021/01/05 14:38:32 [INFO] backend/local: plan operation completed
2021/01/05 14:38:32 [INFO] backend/local: writing plan output to: /terraform/terraform.tfplan
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + version               = (known after apply)

      + kubernetes_network_config {
          + service_ipv4_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_node_group.eks_node_group will be created
  + resource "aws_eks_node_group" "eks_node_group" {
      + ami_type        = (known after apply)
      + arn             = (known after apply)
      + capacity_type   = (known after apply)
      + cluster_name    = "eks_cluster"
      + disk_size       = (known after apply)
      + id              = (known after apply)
      + instance_types  = (known after apply)
      + node_group_name = "eks_node_group"
      + node_role_arn   = (known after apply)
      + release_version = (known after apply)
      + resources       = (known after apply)
      + status          = (known after apply)
      + subnet_ids      = (known after apply)
      + version         = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 1
          + min_size     = 1
        }
    }

  # module.eks.aws_iam_role.eks_node_group_role will be created
  + resource "aws_iam_role" "eks_node_group_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-node-group-role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.eks_role will be created
  + resource "aws_iam_role" "eks_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-cluster-role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.eks-node-group-role-AmazonEC2ContainerRegistryReadOnly will be created
  + resource "aws_iam_role_policy_attachment" "eks-node-group-role-AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks-node-group-role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks-node-group-role-AmazonEKSWorkerNodePolicy will be created
  + resource "aws_iam_role_policy_attachment" "eks-node-group-role-AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-node-group-role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks-node-group-role-AmazonEKS_CNI_Policy will be created
  + resource "aws_iam_role_policy_attachment" "eks-node-group-role-AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-node-group-role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_role-AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "eks_role-AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-cluster-role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_role-AmazonEKSVPCResourceController will be created
  + resource "aws_iam_role_policy_attachment" "eks_role-AmazonEKSVPCResourceController" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "eks-cluster-role"
    }

  # module.vpc.aws_eip.nat_be will be created
  + resource "aws_eip" "nat_be" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + vpc                  = true
    }

  # module.vpc.aws_eip.nat_db will be created
  + resource "aws_eip" "nat_db" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + vpc                  = true
    }

  # module.vpc.aws_internet_gateway.main_internet_gateway will be created
  + resource "aws_internet_gateway" "main_internet_gateway" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.nat_gw_be will be created
  + resource "aws_nat_gateway" "nat_gw_be" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
    }

  # module.vpc.aws_nat_gateway.nat_gw_db will be created
  + resource "aws_nat_gateway" "nat_gw_db" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
    }

  # module.vpc.aws_subnet.private_be will be created
  + resource "aws_subnet" "private_be" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.100.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "Public"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private_db will be created
  + resource "aws_subnet" "private_db" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.200.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "Public"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public_fe will be created
  + resource "aws_subnet" "public_fe" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "Public"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_vpc.main_vpc will be created
  + resource "aws_vpc" "main_vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + eks_role_arn                          = (known after apply)
  + endpoint                              = (known after apply)
  + kubeconfig-certificate-authority-data = (known after apply)
  + vpc_id                                = (known after apply)
```
</details>
*Pusher: @malliparitala, Action: `pull_request`*